[
  {
    "id": "quran-iman",
    "category": "Quran",
    "title": { "en": "Faith (Iman)", "hi": "ईमान" },
    "shortDesc": { "en": "What is Iman?", "hi": "ईमान क्या है?" },
    "references": [
      {
        "label": "Quran 2:285",
        "text": { "en": "The Messenger has believed in what was revealed...", "hi": "रसूल ने जो कुछ..." }
      },
      {
        "label": "Quran 49:15",
        "text": { "en": "The (true) believers are only those who believe...", "hi": "सच्चे मुमिन वही हैं..." }
      }
    ]
  },
  {
    "id": "hadith-niyyah",
    "category": "Hadith",
    "title": { "en": "Intention (Niyyah)", "hi": "नीयत" },
    "shortDesc": { "en": "Importance of intention in Islam", "hi": "इस्लाम में नीयत का महत्व" },
    "references": [
      {
        "label": "Hadith 1",
        "text": { "en": "Actions are judged by intentions.", "hi": "कामों का हिसाब नीयत से होता है।" }
      },
      {
        "label": "Hadith 2",
        "text": { "en": "Each person will get what they intended.", "hi": "हर इंसान को वही मिलेगा जिसे उसने चाहा।" }
      }
    ]
  },
  {
    "id": "dua-peace",
    "category": "Dua",
    "title": { "en": "Prayer for Peace", "hi": "शांति की दुआ" },
    "shortDesc": { "en": "Supplications for peace and tranquility", "hi": "शांति और सुकून के लिए दुआएं" },
    "references": [
      {
        "label": "Dua 1",
        "text": { "en": "O Allah, You are Peace and from You comes peace.", "hi": "ऐ अल्लाह, तू ही सला..." }
      }
    ]
  },
  {
    "id": "hadith-breastfeeding-adult",
    "category": "Hadith",
    "title": { "en": "Breastfeeding an Adult", "hi": "बड़े व्यक्ति को स्तनपान" },
    "shortDesc": { "en": "Hadiths regarding breastfeeding adult individuals", "hi": "बड़े व्यक्तियों को स्तनपान कराने के बारे में हदीस" },
    "references": [
      {
        "label": "Sahih Muslim 1453a",
        "text": {
          "en": "'A'isha (RA) reported that Sahla bint Suhail came to the Prophet (ﷺ) and said: \"Messenger of Allah, I see signs of disgust on the face of Abu Hudhaifa when Salim enters.\" The Prophet (ﷺ) said: \"Breastfeed him so he may enter.\"",
          "hi": "'आइशा (रजि.) ने बताया कि साहला बिंत सुहैल पैगंबर (ﷺ) के पास आईं और कहा: \"अल्लाह के रसूल, जब सलीम हमारे घर में आता है तो अबु हुडीफा के चेहरे पर नापसंदगी दिखती है।\" पैगंबर (ﷺ) ने कहा: \"उसे दूध पिलाओ ताकि वह आ सके।\""
        }
      },
      {
        "label": "Sahih Muslim 1453b",
        "text": {
          "en": "'A'isha (RA) reported that Salim, the freed slave of Abu Hudhaifa, lived with his family. Sahla said to the Prophet (ﷺ) that Salim has reached puberty and enters freely. The Prophet (ﷺ) permitted breastfeeding.",
          "hi": "'आइशा (रजि.) ने बताया कि सलीम, अबु हुडीफा का आज़ाद किया हुआ गुलाम, उनके परिवार के साथ रहता था। साहला ने पैगंबर (ﷺ) से कहा कि सलीम ने बौढ़ापा पा लिया है और वह घर में स्वतंत्र रूप से आता है। पैगंबर (ﷺ) ने स्तनपान की अनुमति दी।"
        }
      },
      {
        "label": "Sunan Abu Dawood 2061",
        "text": {
          "en": "In pre-Islamic times, adopted sons were treated as real sons, but Allah revealed to call them by their biological fathers' names. Sahlah bint Suhail asked the Prophet (ﷺ) about Salim.",
          "hi": "जाहिलीयत में गोद लिए गए पुत्रों को असली पुत्र समझा जाता था, लेकिन अल्लाह ने उनकी वास्तविक पिता के नाम से पुकारने का आदेश दिया। साहला बिंत सुहैल ने पैगंबर (ﷺ) से सलीम के बारे में पूछा।"
        }
      },
      {
        "label": "Sunan an-Nasa’i 3320",
        "text": {
          "en": "'A'ishah reported that Sahlah bint Suhail came to the Prophet (ﷺ) and said that she saw displeasure on Abu Hudhaifa’s face when Salim entered upon her.",
          "hi": "'आइशा ने बताया कि साहला बिंत सुहैल पैगंबर (ﷺ) के पास आईं और कहा कि जब सलीम उनके पास आता है तो अबु हुडीफा के चेहरे पर नापसंदगी होती है।"
        }
      },
      {
        "label": "Muwatta Malik Kitab 30 Hadith 14",
        "text": {
          "en": "The Prophet (ﷺ) said: \"What is haram by birth is haram by suckling.\"",
          "hi": "पैगंबर (ﷺ) ने कहा: \"जो जन्म से हराम है, वह स्तनपान से भी हराम होता है।\""
        }
      },
      {
        "label": "Al Bukhari 312",
        "text": {
          "en": "Hadith text for Al Bukhari 312 not available in the source.",
          "hi": "अल बुखारी 312 की हदीस स्रोत में उपलब्ध नहीं है।"
        }
      },
      {
        "label": "Muslim 289a, 291",
        "text": {
          "en": "Hadith text for Muslim 289a and 291 not available in the source.",
          "hi": "मुस्लिम 289a और 291 की हदीस स्रोत में उपलब्ध नहीं है।"
        }
      }
    ]
  }
]
